Ran Plan for 3 projects:

1. dir: `infra/us-east-1/mgmt/atlantis/ecr` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`

### 1. dir: `infra/us-east-1/mgmt/atlantis/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-17T08:00:56Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ecr.git. Relative paths in downloaded Terraform code may not work.
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=3792795651]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
+   resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "keep last 20 images"
+                       rulePriority = 10
+                       selection    = {
+                           countNumber = 20
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire untagged images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

  # aws_ecr_repository.this[0] will be created
+   resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "scde"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)

+       encryption_configuration {
+           encryption_type = "AES256"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
+   resource "aws_ecr_repository_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "ecr:ListTagsForResource",
+                           "ecr:ListImages",
+                           "ecr:GetRepositoryPolicy",
+                           "ecr:GetLifecyclePolicyPreview",
+                           "ecr:GetLifecyclePolicy",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:GetAuthorizationToken",
+                           "ecr:DescribeRepositories",
+                           "ecr:DescribeImages",
+                           "ecr:DescribeImageScanFindings",
+                           "ecr:BatchGetImage",
+                           "ecr:BatchCheckLayerAvailability",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Sid       = "PrivateReadOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   repository_arn         = (known after apply)
+   repository_registry_id = (known after apply)
+   repository_url         = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/ecr`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/ecr`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/ec2": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/ec2": 
time=2024-01-17T08:00:56Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/vpc] 
time=2024-01-17T08:01:15Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/security-group/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/ec2/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-17T08:01:15Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 3. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-17T08:00:56Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/vpc] 

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sg.aws_security_group.this_name_prefix[0] will be created
+   resource "aws_security_group" "this_name_prefix" {
+       arn                    = (known after apply)
+       description            = "Security Group managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "scde-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "scde"
        }
+       tags_all               = {
+           "Environment"  = "mgmt"
+           "Name"         = "scde"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                 = "vpc-05d9f25d63d8ffb04"

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.sg.aws_security_group_rule.egress_rules[0] will be created
+   resource "aws_security_group_rule" "egress_rules" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "All protocols"
+       from_port                = -1
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = -1
+       type                     = "egress"
    }

  # module.sg.aws_security_group_rule.ingress_rules[0] will be created
+   resource "aws_security_group_rule" "ingress_rules" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "SSH"
+       from_port                = 22
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = []
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 22
+       type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.ingress_with_self[0] will be created
+   resource "aws_security_group_rule" "ingress_with_self" {
+       description              = "Ingress Rule"
+       from_port                = -1
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = -1
+       type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   security_group_arn         = (known after apply)
+   security_group_description = "Security Group managed by Terraform"
+   security_group_id          = (known after apply)
+   security_group_name        = (known after apply)
+   security_group_owner_id    = (known after apply)
+   security_group_vpc_id      = "vpc-05d9f25d63d8ffb04"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/security-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fsecurity-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/security-group`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`